// -----------------------------------------урок 19
// i++ === i = i + 1

// for (let i = 1; i <= 10; i++) {
//   console.log("пробежал круг:", i);
// }

// -----------------------------------------урок 20

// let number = +prompt("введите число больше 10", 10);

// while (number < 10) {
//   number = +prompt("введите число больше 10", 10);
// }

// let i = 5;

// while (i > 0) {
//   console.log(i);
//   i--;
// }

// do {
//   number = +prompt("введите число больше 10", 10);
// } while (number < 10);

// -----------------------------------------урок 21

// number = +prompt("введите число", 0);

// for (let i = 1; i <= number; i++) {
//   if (number > 20) {
//     break;
//   }
//   console.log(i);
// }

// -----------------------------------------урок 22

// for (let i = 1; i <= 5; i++) {
//   for (let j = 1; j <= 3; j++) {
//     console.log(`внешний цикл: ${i}`, `внутренний цикл: ${j}`);
//   }
// }
// let line = "";

// for (let i = 1; i <= 4; i++) {
//   for (let j = 1; j <= i; j++) {
//     line += "*";
//   }
//   line += "\n";
// }

// console.log(line);
